app/controllers/shortended_urls_controller.rb

INSERT INTO "shortended_urls" ("original_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["original_url", "www.google.com"], ["short_url", "8v51mz"], ["created_at", "2020-09-07 05:43:07.991743"], ["updated_at", "2020-09-07 05:43:07.991743"]]
SELECT  "shortended_urls".* FROM "shortended_urls" WHERE "shortended_urls"."short_url" = $1 ORDER BY "shortended_urls"."id" DESC LIMIT $2  [["short_url", "8v51mz"], ["LIMIT", 1]]
---
  def create
    @url = ShortendedUrl.new
    @url.original_url = params[:original_url]
    if @url.new_url?
      if @url.save
        redirect_to shortended_path(@url.short_url)

      else
        flash[:error] = "Check the error Below"
        render 'index'
      end
    else
      flash[:notice] = "A short link for this URL is already  in our DB"
      redirect_to shortended_path(@url.find_duplicate.short_url)

SELECT  "shortended_urls".* FROM "shortended_urls" WHERE "shortended_urls"."short_url" = $1 LIMIT $2  [["short_url", "8v51mz"], ["LIMIT", 1]]
---
def shortended
  @url = ShortendedUrl.find_by_short_url(params[:short_url])

SELECT  "shortended_urls".* FROM "shortended_urls" WHERE "shortended_urls"."short_url" = $1 LIMIT $2  [["short_url", "show"], ["LIMIT", 1]]
---
def find_url
  @url = ShortendedUrl.find_by_short_url(params[:short_url])